# InfillDifferentPhase Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..InfillFailures..::..InfillDifferentPhase Property
BuiltInFailures..::..InfillFailures Class See Also
---
Wall and instance have different phasing settings. Automatic creation of the infilling wall fails.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InfillDifferentPhase { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InfillDifferentPhase As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InfillDifferentPhase {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..InfillFailures Class
Autodesk.Revit.DB Namespace